TITANIC SURVIVOR ANALYSIS

In [5]:
import pandas as pd
import numpy as np

In [6]:
df= pd.DataFrame(pd.read_csv('/content/train.csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [7]:
df.shape

(891, 12)

HANDELLING NULL VALUES

In [22]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [24]:
x= df.isnull().sum()

drop_col = df.isnull().sum()[x > (35/100*df.shape[0])]
drop_col

Series([], dtype: int64)

In [25]:
drop_col.index

Index([], dtype='object')

In [26]:
df.drop(drop_col.index,axis=1, inplace= True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [28]:
df.fillna(df.mean(), inplace= True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [29]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [31]:
df['Embarked'].fillna('S', inplace= True)

In [32]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [33]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [34]:
df['FamilySize']= df['SibSp']=df['Parch']
df.drop(['SibSp','Parch'], axis = 1, inplace= True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.001652
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.081629
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.018443
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.179191
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.216225
FamilySize     -0.001652  0.081629  0.018443 -0.179191  0.216225    1.000000

In [35]:
df['Alone']= [0 if df['FamilySize'][i] > 0 else 1 for i in df.index ]
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          0      1
1            2         1       1  ...        C          0      1
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          0      1
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [37]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.511737
1    0.343658
Name: Survived, dtype: float64

In [38]:
df[['Alone', 'Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.237717
Fare  -0.237717  1.000000

In [40]:
df['Sex']=  [0 if df['Sex'][i]== "male"  else 1 for i in df.index ]
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [42]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

CONCLUSION


*   Female passengers were prioritezed over man.
*   people with high class or rich people have higher survivol rate than others. the hierarchy might have been followed while saving the passangers.
*   Passengers travelling with their family have higher surivol rate.
*   Passengers who boarded the ship aht Cherbourg, survived ,more in proportion then the others